String launchFns() {
  task1();
  task2();
  task3();
  task4();
  task5();
  task6();
  task7();
  task8();
  task9();
  task10();

  return 'Test finished';
}

/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
  final width = 18.4;
  final height = 30.9;

  /// Периметр
  final p = width * 2 + height * 2;

  /// Площа
  final s = width * height;

  /// Кількість повних квадратів
  final amountSq = height ~/ width;

  print('Периметр: $p');
  print('Площа: $s');
  print('Кількість повних квадратів: $amountSq');
  print('--------------------------');
}

/// Завдання 2: Оператори порівняння
/// Створіть змінну number.
///
/// Перевірте:
/// Чи більше число за 50.
/// Чи менше число за 100.
/// Чи ділиться число на 5 без залишку.
/// Виведіть всі результати.
void task2() {
  final someNumber = 70;

  /// Чи більше число за 50.
  final isGreater = someNumber > 50;

  /// Чи менше число за 100.
  final isLess = someNumber < 100;

  /// Чи ділиться число на 5 без залишку.
  final isEqualZero = someNumber % 5 == 0;

  print('Чи більше число за 50. - $isGreater');
  print('Чи менше число за 100. - $isLess');
  print('Чи ділиться число на 5 без залишку. - $isEqualZero');
  print('--------------------------');
}

/// Завдання 3: Логічні оператори
/// Створіть змінні hasMoney і isStoreOpen (типу bool).
///
/// Перевірте:
/// Чи можна зробити покупку (якщо є гроші і магазин відкритий).
/// Чи потрібно почекати (якщо магазин закритий або немає грошей).
/// Використайте оператори &&, ||, !.
void task3() {
  final hasMoney = true;
  final isStoreOpen = true;

  /// Case #1 Чи можна зробити покупку (якщо є гроші і магазин відкритий).
  final isOrderAvailable = hasMoney && isStoreOpen;

  print(
    'Чи можна зробити покупку (якщо є гроші і магазин відкритий) '
    '$isOrderAvailable',
  );

  /// Case #2 Чи потрібно почекати (якщо магазин закритий або немає грошей).
  final isOnHold = !hasMoney || !isStoreOpen;

  print(
    'Чи потрібно почекати (якщо магазин закритий або немає грошей) $isOnHold',
  );
  print('--------------------------');
}

/// Завдання 4: Тернарний оператор
/// Створіть змінну temperature.
///
/// Використайте тернарний оператор, щоб визначити:
/// Якщо більше 25 — “Тепло”.
/// Якщо менше або дорівнює 25 — “Прохолодно”.
/// Потім створіть ще один тернарний оператор:
/// Якщо менше 10 — вивести “Дуже холодно”.

void task4() {
  final temperature = 9;
  final resultCase1 = temperature <= 25 ? 'Прохолодно' : 'Тепло';
  final resultCase2 = temperature < 10 ? 'Дуже холодно' : resultCase1;

  print('Тепло чи Прохолодно - $resultCase1');
  print('Тепло чи Прохолодно чи Дуже холодно - $resultCase2');
  print('--------------------------');
}

/// Завдання 5: Оператори присвоєння
/// Використовувати тільки оператори присвоєння (+=, -=, *=, /=)
///
/// Створіть змінну score = 0.
/// Створіть зміни з даними:
/// correctAnswers = 17;
/// mistakes = 3;
/// totalQuestions = 20;
///
/// Додайте 10 балів за кожну правильну відповідь.
/// Відніміть 5 балів за кожну помилку.
///
/// Збільшити загальну кількість балів у 2 рази.
/// Поділіть бали на кількість запитань.
/// Виведіть остаточний результат.

void task5() {
  double score = 0;

  final correctAnswers = 17;
  final mistakes = 3;
  final totalQuestions = 20;

  /// Case #1 Додайте 10 балів за кожну правильну відповідь.
  score += 10 * correctAnswers;
  print('Case #1 Додайте 10 балів за кожну правильну відповідь. - $score');

  /// Case #2 Відніміть 5 балів за кожну помилку.
  score -= mistakes * 5;
  print('Case #2 Відніміть 5 балів за кожну помилку. - $score');

  /// Case #3 Збільшити загальну кількість балів у 2 рази.
  score *= 2;
  print('Case #3 Збільшити загальну кількість балів у 2 рази. - $score');

  /// Case #4 Поділіть бали на кількість запитань.
  score /= totalQuestions;
  print('Case #4 Поділіть бали на кількість запитань. - $score');
  print('--------------------------');
}

/// Завдання 6: Умовні конструкції if/else
/// Створіть змінну examScore з значенням 56
/// Створіть умовні конструкції if / else if / else
/// Якщо більше 90 — вивести “Відмінно”.
///
/// Якщо 75–90 — “Добре”.
/// Якщо 60–74 — “Задовільно”.
/// Якщо менше 60 — “Не здано”.
///
/// Додатково: якщо оцінка менше 20 — вивести “Повторити курс”.
/// Поексперементуйте, змінюючи  значення examScore

void task6() {
  final examScore = 91;

  if (examScore > 90) {
    print('Відмінно');
  } else if (75 <= examScore && examScore <= 90) {
    print('Добре');
  } else if (60 <= examScore && examScore <= 74) {
    print('Задовільно');
  } else if (examScore < 20) {
    print('Повторити курс');
  } else {
    print('Не здано');
  }
  print('--------------------------');
}

/// Завдання 7: Конструкція switch statement
/// Створіть змінну dayNumber від 1 до 7.
///
/// Використайте switch, щоб вивести:
/// Понеділок, Вівторок, …, Неділя.
/// Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
/// Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

void task7() {
  final dayNumber = '7';

  final willGoToWork = switch (dayNumber) {
    '1' => 'Понеділок',
    '2' => 'Вівторок',
    '3' => 'Середа',
    '4' => 'Четвер',
    '5' => "П'ятниця",
    '6' => 'Субота',
    '7' => 'Неділя',
    _ => 'Невірний номер дня',
  };

  final isDayOff = willGoToWork == 'Субота' || willGoToWork == 'Неділя'
      ? 'Вихідний день'
      : '';

  print('$willGoToWork. $isDayOff');
  print('--------------------------');
}

/// Завдання 8: Цикли for
/// Виведіть всі числа від 1 до 10.
/// Виведіть тільки парні числа.
/// Обчисліть суму чисел від 1 до 10.

void task8() {
  final numbers = <int>[];
  var sum = 0;

  for (var i = 0; i <= 10; i++) {
    if (i != 0 && i % 2 == 0) {
      numbers.add(i);
    }

    sum += i;
  }

  print('Even numbers: $numbers');
  print('Sum: $sum');
  print('--------------------------');
}

/// Завдання 9: Цикл while
/// Почніть із числа 10.
///
/// Виводьте числа, зменшуючи їх на 1, поки не досягнете 0.
/// Якщо число парне — вивести “Парне число: …”,
/// якщо непарне — “Непарне число: …”.

void task9() {
  final numbers = <String>[];
  var counter = 10;

  while (counter > 0) {
    if (counter % 2 == 0) {
      numbers.add('Парне число: $counter');
    } else {
      numbers.add('Непарне число: $counter');
    }
    counter--;
  }

  print(numbers);
  print('--------------------------');
}

/// Завдання 10: Break і Continue
/// Створіть цикл for від 1 до 20.
///
/// Якщо число ділиться на 3 без залишку — пропустіть його (continue).
/// Якщо число більше 15 — зупиніть цикл (break).
/// Виведіть тільки ті числа, які пройшли обидві перевірки.
void task10() {
  final numbers = <int>[];

  for (var i = 0; i <= 20; i++) {
    if (i % 3 == 0 && i != 15) {
      continue;
    } else if (i == 15) {
      break;
    } else {
      numbers.add(i);
    }
  }

  print(numbers);
}
